{
  "source": "prompts.csv",
  "total_rows": 81,
  "selected_examples": 4,
  "selection_note": "Shortest structurally unique rows, filtered to avoid quality-tag style leakage.",
  "examples": [
    {
      "source_prompt_id": "6",
      "source_tweet_id": "2011927126375612648",
      "signature": [
        "image_generation_prompt"
      ],
      "input_json_excerpt": "{\"image_generation_prompt\":{\"subject_and_pose\":{\"subject\":\"Beautiful young Japanese woman with long, straight platinum blonde hair, fair skin, and an athletic full hourglass figure.\",\"pose\":\"Sitting on the edge of a yellow swim platform, angled away from the camera but twisting her upper body to look back...\",\"accessories\":\"Gold hoop earrings, a thin silver or diamond tennis bracelet on the right wrist, and multiple rings on the fingers of the...\"},\"outfit\":{\"garment\":\"A two-piece bikini set.\",\"colors\":\"White.\",\"details\":\"Triangle top with white straps. High-cut, thong-style bikini bottoms with side ties featuring long, dangling white strings. The suit fits snugly, highlighting...\"},\"environment\":{\"setting\":\"A sunny, coastal maritime setting, likely a bay or inlet.\",\"background\":\"Deep blue, rippling sea water stretching to the horizon. Rugged, arid mountains with sparse scrub vegetation are visible in the distance under...\",\"foreground_elements\":\"The subject sits on a textured, bright yellow surface (likely a boat deck or pontoon). Curved silver stainless steel handrails (part of...\"},\"lighting_and_shot\":{\"lighting\":\"Harsh, bright natural sunlight indicating midday. Strong, defined shadows cast by the subject and the handrails onto the yellow platform. The light...\",\"camera_angle\":\"Medium shot captured from slightly behind and to the side, at eye level with the seated subject.\",\"style\":\"Photorealistic, high-definition, vibrant travel photography aesthetic, sharp focus on the subject with a deep depth of field keeping the background mountains visible.\"},\"aspect_ratio\":\"3:4\"}}",
      "sfw_output_excerpt": "Photorealistic high-definition vibrant travel photography in a sunny coastal bay, aspect ratio 3:4: a beautiful young Japanese woman with long, straight platinum blonde hair and fair skin sits on the edge of a textured bright yellow swim platform on a boat, framed on both sides by curved silver stainless-steel handrails from a swim ladder. She wears a white two-piece bikini with a triangle top and high-cut thong-style bottoms tied at the sides with long dangling white strings, snug against her athletic full hourglass figure. Captured as a medium shot from slightly behind and to the side at eye level, she angles her body away from the viewer while twisting her upper body to look back over her left shoulder directly."
    },
    {
      "source_prompt_id": "11",
      "source_tweet_id": "2011264537450987944",
      "signature": [
        "image_description"
      ],
      "input_json_excerpt": "{\"image_description\":{\"subject\":{\"person\":\"A slender blonde woman with long hair, wearing a sheer, shimmering gold mesh mini dress with thin spaghetti straps and a vertical...\",\"accessories\":\"Layered gold necklaces, gold bracelets, and metallic gold high-heeled sandals.\",\"pose\":\"Standing elegantly in front of a luxury car, legs crossed at the ankles, looking directly at the camera.\"},\"vehicle\":{\"type\":\"A sleek, modern white supercar with gold accents.\",\"details\":\"High-gloss white paint, metallic gold rims, gold trim around the windows, and low-profile body styling.\"},\"environment\":{\"location\":\"A bright, high-end luxury car showroom.\",\"lighting\":\"Clean, architectural indoor lighting with soft reflections on the polished white floor.\",\"background\":\"Large floor-to-ceiling glass windows showing other vehicles in a blurred outdoor setting.\"},\"technical_style\":{\"composition\":\"Full-body shot, eye-level angle, centered subject.\",\"aesthetic\":\"High-fashion photography, photorealistic, sharp focus on the subject with a shallow depth of field (bokeh) in the background.\",\"color_palette\":\"Dominant white and gold, with neutral grey and black architectural tones.\"}}}",
      "sfw_output_excerpt": "Create a photorealistic high-fashion full-body image at eye level of a slender blonde woman with long hair standing elegantly in a bright, high-end luxury car showroom, centered in the frame and looking directly at the viewer. She wears a sheer, shimmering gold mesh mini dress with thin spaghetti straps and a vertical gold zipper detail, styled with layered gold necklaces, gold bracelets, and metallic gold high-heeled sandals; her legs are crossed at the ankles in a poised stance. Behind her is a sleek modern white supercar with high-gloss white paint, metallic gold rims, gold trim around the windows, and low-profile styling. The showroom features a polished white floor with soft reflections and large floor-to-ceiling glass windows revealing other vehicles outside."
    },
    {
      "source_prompt_id": "46",
      "source_tweet_id": "2005002407013400789",
      "signature": [
        "model_hint",
        "negative_prompt",
        "prompt"
      ],
      "input_json_excerpt": "{\"prompt\":\"A close-up photograph of the platinum-haired woman stretching her arms, viewed from the side. She is wearing a very tight, white ribbed...\",\"negative_prompt\":\"loose clothing, oversized clothes, smooth skin, plastic render, heavy makeup, studio photo\",\"model_hint\":\"Focus on how the tight ribbed fabric accentuates body contours without being explicit. Raw texture.\"}",
      "sfw_output_excerpt": "A close-up side-view photograph of a platinum-haired woman stretching her arms, wearing a very tight white ribbed cotton tank top that clings to her torso and low-rise grey track pants, with the composition emphasizing the raw ribbed fabric texture pulled taut over her ribs and the subtle curve of her waist; her hair is gathered into a messy bun, lit by natural indoor light with a grainy film texture and an intimate, realistic feel. Aspect ratio 4:5. CONSTRAINTS: no loose or oversized clothing, no overly smooth skin, no plastic/CGI look, no heavy makeup, no studio-photo lighting or backdrop"
    },
    {
      "source_prompt_id": "8",
      "source_tweet_id": "2011431885986320524",
      "signature": [
        "camera",
        "composition",
        "lighting",
        "mood",
        "prompt",
        "quality",
        "style"
      ],
      "input_json_excerpt": "{\"prompt\":\"A natural, sunlit lifestyle portrait of a woman relaxing on a wooden lounge chair in a rustic Mediterranean garden. She is wearing...\",\"style\":\"photorealistic, lifestyle photography\",\"lighting\":\"warm natural daylight, soft shadows, late afternoon sun\",\"camera\":{\"lens\":\"50mm\",\"aperture\":\"f/2.2\",\"focus\":\"sharp subject, gently blurred background\"},\"composition\":\"side-profile seated portrait, candid moment\",\"mood\":\"calm, summery, intimate, relaxed\",\"quality\":\"high detail, natural skin tones, professional photography\"}",
      "sfw_output_excerpt": "Photorealistic lifestyle photography in a 4:5 aspect ratio: a high-detail, professional side-profile seated portrait captured in a candid moment of a woman relaxing on a wooden lounge chair in a rustic Mediterranean garden. She wears a red string bikini and a light-colored baseball cap, sitting casually while adjusting the side tie of the bikini bottom; her blonde hair is loose with soft curls. The environment includes sun-warmed stone walls, olive trees, dry earth, and flowering plants, emphasizing natural textures and an authentic countryside summer atmosphere. Warm natural late-afternoon daylight creates soft shadows; keep the subject sharply in focus with a gently blurred background, natural skin tones, calm intimate relaxed mood. Shot on a 50mm lens at f/2.2."
    }
  ]
}
